Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
s1=pd.Series([4,8,15,16,23,])

In [4]:
s1

0     4
1     8
2    15
3    16
4    23
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
list1=[1,2,3,4,5,6,7,8,9,11]

In [6]:
s2=pd.Series(list1)

In [7]:
s2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    11
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
dict1={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df=pd.DataFrame(dict1)

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In brief, a DataFrame in pandas is a two-dimensional, tabular data structure with labeled axes (rows and columns). It is similar to a table in a relational database or an Excel spreadsheet. Each column in a DataFrame is a Series, and the entire structure is designed for handling and analyzing structured data.

A pandas Series, on the other hand, is a one-dimensional labeled array, resembling a column or a single variable. It has an index and holds data of a specific data type.

In summary, a DataFrame is a collection of Series, providing a way to organize and analyze data in a structured format.

EXAMPLE-

In [10]:
#series
s3=pd.Series([4,8,45,15,65,16,23,])
s3

0     4
1     8
2    45
3    15
4    65
5    16
6    23
dtype: int64

In [11]:
#dataframe
list2=[['kanpur','uttar pradesh'],['mumbai','maharashtra'],['jaipur','rajasthan']]
df1=pd.DataFrame(list2,columns=['city','state'])
df1

     city          state
0  kanpur  uttar pradesh
1  mumbai    maharashtra
2  jaipur      rajasthan

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Selection and Filtering:

loc and iloc: Selecting rows and columns by labels or integer indices.
Boolean indexing: Filtering rows based on conditions.
Modification:

head() and tail(): Displaying the first or last N rows.
drop(): Removing specified rows or columns.
rename(): Renaming columns.
fillna(): Filling missing values.
Aggregation and Statistics:

groupby(): Grouping data based on specified criteria.
mean(), sum(), count(): Calculating statistics for groups.
describe(): Generating descriptive statistics.
Sorting:

sort_values(): Sorting DataFrame by specified columns.
Combining DataFrames:

concat(): Concatenating DataFrames along a particular axis.
merge(): Merging DataFrames based on a common column or index.
Data Cleaning:

drop_duplicates(): Removing duplicate rows.
astype(): Changing data types of columns.
Handling Missing Data:

isna(), dropna(): Detecting and dropping missing values.
fillna(): Filling or interpolating missing values.
Column and Index Operations:

set_index(), reset_index(): Setting and resetting the DataFrame index.
columns: Accessing and modifying column labels.

In [12]:
df1.head(1)

     city          state
0  kanpur  uttar pradesh

In [13]:
df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series: Mutable. You can modify the values, index, and other properties of a pandas Series after its creation.

DataFrame: Mutable. You can modify the contents of a DataFrame, add or remove columns, change column names, and perform various other operations to alter the structure and data within the DataFrame.
In pandas, the Panel data structure is mutable, meaning you can modify its contents after it is created. However, it's important to note that the Panel has been deprecated since pandas version 0.25.0. The deprecation means that while it is still available in older versions of pandas, it is no longer actively supported or recommended for use in newer code.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
names = pd.Series(['Alice', 'Bob', 'Charlie'], name='Name')
ages = pd.Series([25, 30, 35], name='Age')
cities = pd.Series(['New York', 'San Francisco', 'Los Angeles'], name='City')

In [16]:
df2 = pd.DataFrame({'Name': names, 'Age': ages, 'City': cities})

In [17]:
df2

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles